#+TITLE:      Introducing Babel
#+AUTHOR:     Eric Schulte, Dan Davison, Tom Dye
#+EMAIL:      schulte.eric at gmail dot com, davison at stats dot ox dot ac dot uk, tsd at tsdye dot online
#+OPTIONS:    H:3 num:nil toc:2 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+HTML_LINK_UP:  index.html
#+HTML_LINK_HOME: https://orgmode.org/worg

# This file is released by its authors and contributors under the GNU
# Free Documentation license v1.3 or later, code examples are released
# under the GNU General Public License v3 or later.

** Functional Mode
    :PROPERTIES:
    :CUSTOM_ID: results-value
    :END:
    The 'result' of code evaluation is the value of the last
    statement in the code block. In functional mode, the code block is
    a function with a return value. Functional mode is indicated by
    setting the header argument =:results value=.

    The return value of one code block can be used as input for
    another code block, even one in a different language.  In this
    way, Babel becomes a [[#meta-programming-language][meta-programming language]]. If the block
    returns tabular data (a vector, array or table of some sort) then
    this will be held as an Org table in the buffer. This setting is
    the default.

    For example, consider the following block of Python code and its
    output.

    #+name: python-tutorial-functional-mode
    #+begin_src python :results value :exports both
import time
print("Hello, today's date is %s" % time.ctime())
print('Two plus two is')
return 2 + 2
    #+end_src

    #+RESULTS: python-tutorial-functional-mode
    : 4

    Notice that, in functional mode, the output consists of the value of
    the last statement and nothing else.

** Scripting Mode
    :PROPERTIES:
    :CUSTOM_ID: results-output
    :END:

    In scripting mode, Babel captures the text output of the code
    block and places it in the Org buffer.  Scripting mode is
    indicated by setting the header argument =:results output=.

    It is called scripting mode because the code block contains a
    series of commands, and the output of each command is
    returned. Unlike functional mode, the code block itself has no
    return value apart from the output of the commands it
    contains.[fn:2]

    Consider the result of evaluating this code block with
    scripting mode.

    #+name: python-tutorial-scripting-mode
    #+begin_src python :results output :exports both
import time
print("Hello, today's date is %s" % time.ctime())
print('Two plus two is')
2 + 2
    #+end_src

    #+RESULTS: python-tutorial-scripting-mode
    : Hello, today's date is Sat Oct 16 10:48:47 2021
    : Two plus two is

    Here, scripting mode returned the text that Python sent to
    =stdout= with the two =print()= statements.  Because the code
    block doesn't include a =print()= statement for the last value,
    =(2 + 2)=, 4 does not appear in the results.

** Example 2: Org Babel Test Suite
    While developing Babel, we used a suite of tests implemented
    as a large Org table.  To run the entire test suite we simply
    evaluate the table with =C-u C-c C-c=: all of the tests are run,
    the results are compared with expectations, and the table is updated
    with results and pass/fail statistics.

    Here's a sample of our test suite.

    In the Org file:

    : #+name: org-babel-tests
    : | functionality    | block        | arg |    expected |     results | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | basic evaluation |              |     |             |             | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    : | shell            | basic-shell  |     |           6 |           6 | pass |
    : | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    : | python           | basic-python |     | hello world | hello world | pass |
    : | R                | basic-R      |     |          13 |          13 | pass |
    : #+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

    HTML export of code:

    #+name: org-babel-tests
    | functionality    | block        | arg |    expected |     results | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | basic evaluation |              |     |             |             | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    | shell            | basic-shell  |     |           6 |           6 | pass |
    | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    | python           | basic-python |     | hello world | hello world | pass |
    | R                | basic-R      |     |          13 |          13 | pass |
    #+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

